In [2]:
from faker import Faker

In [3]:
fake = Faker()

In [5]:
users = []
for i in range(10001, 500000):
    users.append([i, fake.unique.user_name(), fake.unique.email(), fake.sentence()])

In [6]:
import pandas as pd

In [7]:
users = pd.DataFrame(users, columns=["id", "username", "email", "status_message"])
users

,id,username,email,status_message
0,10001,taranorris,uwilliams@example.com,Until service scene.
1,10002,joanne53,jose81@example.org,Throughout increase you challenge.
2,10003,xrusso,michael60@example.net,Small road eat service cell four.
3,10004,dennis49,ijordan@example.org,Value leave responsibility hear ago tax forwar...
4,10005,madisonramos,andrewknight@example.org,Pressure my time security kid.
...,...,...,...,...
489994,499995,serranorobin,ivan80@example.net,Bank model recently building fire prove billio...
489995,499996,greersheena,jamesmccall@example.net,Father reflect difficult eight.
489996,499997,conniemann,carterallison@example.com,Summer buy as people.
489997,499998,gallowaybradley,choikaren@example.net,Involve book show position far appear trouble ...
489998,499999,gilberthelen,gonzalezleah@example.org,Trial too create hand write simple.

In [8]:
users.to_csv("users.csv", index=False)